evidence/perf/dflash2-20260819T014205Z/c4-r1.log
EXTRA_BODY {"chat_template_kwargs":{"enable_thinking":false}}
/sgl-workspace/sglang/python/sglang/srt/environ.py:1402: UserWarning: Environment variable SGLANG_FLASHINFER_PR4266_SOURCE has been deprecated.
  warnings.warn(f"Environment variable {old_name} has been deprecated.")
W0819 01:49:09.530000 1557 torch/utils/_pytree.py:630] <enum 'KernelPreference'> is an Enum subclass and is now natively supported by torch.compile as an opaque value type. Calling register_constant() on Enum subclasses is deprecated and will be an error in a future release.
W0819 01:49:09.549000 1557 torch/utils/_pytree.py:630] <enum 'ScaleCalculationMode'> is an Enum subclass and is now natively supported by torch.compile as an opaque value type. Calling register_constant() on Enum subclasses is deprecated and will be an error in a future release.
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
  0%|          | 0/16 [00:00<?, ?it/s]benchmark_args=Namespace(backend='sglang-oai-chat', base_url='http://127.0.0.1:30000', host='0.0.0.0', port=None, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='qwen38-27b', served_model_name=None, tokenizer='/model', num_prompts=16, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=256, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=4, output_file='/tmp/dflash2-20260819T014205Z-qwen38-c4-r1.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=0, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"chat_template_kwargs":{"enable_thinking":false}}', apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, flush_cache_timeout=60.0, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30000/v1/models to become ready...
Server ready in 0.0s.
Fail to load tokenizer config with error=qwen38-27b is not a local folder and is not a valid model identifier listed on 'https://huggingface.co/models'
If this is a private repository, make sure to pass a token having permission to this repo either by logging in with `hf auth login` or by passing `token=<your_token>`

WARNING It is recommended to use the `Chat` or `Instruct` model for benchmarking.
Because when the tokenizer counts the output tokens, if there is gibberish, it might count incorrectly.

Namespace(backend='sglang-oai-chat', base_url='http://127.0.0.1:30000', host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='qwen38-27b', served_model_name=None, tokenizer='/model', num_prompts=16, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=256, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=4, output_file='/tmp/dflash2-20260819T014205Z-qwen38-c4-r1.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=0, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"chat_template_kwargs":{"enable_thinking":false}}', apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, flush_cache_timeout=60.0, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 8452
#Output tokens: 1690
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 16/16 [00:30<00:00,  1.93s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    inf       
Max request concurrency:                 4         
Successful requests:                     16        
Benchmark duration (s):                  30.97     
Total input tokens:                      8452      
Total input text tokens:                 8452      
Total generated tokens:                  1690      
Total generated tokens (retokenized):    1448      
Request throughput (req/s):              0.52      
Input token throughput (tok/s):          272.94    
Output token throughput (tok/s):         54.58     
Peak output token throughput (tok/s):    27.00     
Peak concurrent requests:                6         
Total token throughput (tok/s):          327.51    
Concurrency:                             3.58      
Accept length:                           3.34      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   6931.12   
Median E2E Latency (ms):                 5278.77   
P90 E2E Latency (ms):                    12571.36  
P95 E2E Latency (ms):                    15885.56  
P99 E2E Latency (ms):                    20881.14  
---------------Time to First Token----------------
Mean TTFT (ms):                          1074.38   
Median TTFT (ms):                        1036.05   
P90 TTFT (ms):                           1775.50   
P95 TTFT (ms):                           1775.60   
P99 TTFT (ms):                           1775.63   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          54.26     
Median TPOT (ms):                        52.63     
P90 TPOT (ms):                           92.43     
P95 TPOT (ms):                           98.88     
P99 TPOT (ms):                           104.15    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           62.33     
Median ITL (ms):                         29.06     
P90 ITL (ms):                            145.37    
P95 ITL (ms):                            175.41    
P99 ITL (ms):                            520.07    
Max ITL (ms):                            1589.82   
==================================================
  qwen38-c4-r1.json: output_throughput=54.58 tok/s completed=16 accept=3.3377862595419847 errors=None